# Лабораторная работа 3

## Циклы

### **Задание A**

1. Дана последовательность целых чисел. Выведите их среднее квадратичное (т.е. сумма
квадратов, деленное на количество элементов). Обратите внимание: среднее квадратичное
— это вещественное число!<br>*Пример*.<br>Ввод: 5 1 3 4 4 8
Вывод: 21.2

```
#include <iostream>  
using namespace std;    
int main(){  
    double b, c, otv;   
    cout << "b is";  
    cin >> b;
    for(int i=0; i<b; ++i){
        cin >> c;
        c = c * c;
        otv += c;
    }
    otv = otv / b;
    cout << otv;
}
```
2. Дана последовательность вещественных чисел. Выведите через пробел количество поло-
жительных, отрицательных и нулей среди них.
<br>*Пример*.<br>
Ввод: 8 1 -3 6 -19 -93 8 0 0
Вывод: 3 3 2

```
dadada
```
3. Вклад в банке составляет x рублей. Ежегодно он увеличивается на p процентов, после чего
дробная часть от копеек отбрасывается. Определите, через сколько лет вклад составит не
менее y рублей. В задаче запрещено использовать дробные числа.
Программа получает на вход три натуральных числа: x, p, y. Программа должна вывести
одно целое число — ответ на задачу.
<br>*Пример*.<br> Ввод: 100 10 200
Вывод: 8

